TLAY-IO/arc-drone-show-demo/apps/ecandle/sdkconfig.defaults
# SPDX-License-Identifier: MIT
# Defaults for the eCandle reference seller (ESP32-C3 + NimBLE peripheral).

# --- target ---
# Pin the chip so a fresh `idf.py build` (no prior `idf.py set-target`) configures
# for esp32c3, not the ESP-IDF default (esp32). Without this a fresh clone builds
# a wrong-chip image that fails to flash ("This chip is ESP32-C3, not ESP32").
CONFIG_IDF_TARGET="esp32c3"

# --- BLE (NimBLE) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
# Buyer's 0xEE04 proof JSON (~400 B) must fit one Write — MTU >= 512.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120

# --- runtime ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- NVS (device keypair persistence for the MER identity tier) ---
CONFIG_NVS_ENCRYPTION=n

# --- flash + partitions ---
# The uplink build (NimBLE + WiFi + MQTT + full-profile BoAT MER) is ~1.07 MB,
# over the default 1 MB app partition. 4 MB flash + a custom single-app (no OTA)
# table gives the app 3 MB.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
